<div  align='center'><img src='https://s3.amazonaws.com/weclouddata/images/logos/wcd_logo_new_2.png' width='25%'></div >

<h1 align="center"> Pandas Advanced Excerise </h1>
<h2 align="center"> (Exercise Version) </h2></font></b></p>

<br>
<center align="center"> Designed by: </center>
<center align="center"> WeCloudData Academy </center>

# Telecom Dataset:

> Dataset can be downloaded from here:
- https://s3.amazonaws.com/weclouddata/datasets/genai/ml_fundamentals/telecom.csv

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Download and explore the dataset in pandas
df = pd.read_csv('telecom.csv')
df.head()

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.5,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes

In [3]:
df.shape

(7043, 21)

In [4]:
df.columns

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customerID        7043 non-null   object
 1   gender            7043 non-null   object
 2   SeniorCitizen     7043 non-null   int64
 3   Partner           7043 non-null   object
 4   Dependents        7043 non-null   object
 5   tenure            7043 non-null   int64
 6   PhoneService      7043 non-null   object
 7   MultipleLines     7043 non-null   object
 8   InternetService   7043 non-null   object
 9   OnlineSecurity    7043 non-null   object
 10  OnlineBackup      7043 non-null   object
 11  DeviceProtection  7043 non-null   object
 12  TechSupport       7043 non-null   object
 13  StreamingTV       7043 non-null   object
 14  StreamingMovies   7043 non-null   object
 15  Contract          7043 non-null   object
 16  PaperlessBilling  7043 non-null   object
 17  PaymentMethod     7043 non-null   object
 18  MonthlyCharges    7043 non-null   float64
 19  TotalCharges      7043 non-null   object
 20  Churn             7043 non-null   object
dtypes: float64(1), int64(2), object(18)
memory usage: 1.1+ MB

In [6]:
df.describe()

       SeniorCitizen       tenure  MonthlyCharges
count    7043.000000  7043.000000     7043.000000
mean        0.162147    32.371149       64.761692
std         0.368612    24.559481       30.090047
min         0.000000     0.000000       18.250000
25%         0.000000     9.000000       35.500000
50%         0.000000    29.000000       70.350000
75%         0.000000    55.000000       89.850000
max         1.000000    72.000000      118.750000

### 1. Create a pivot table for the follwing:
>    - The average `MonthlyCharges` per `InternetService` for males and females.
>    - The maximum `MonthlyCharges` per `Contract` for Seniors / Non-seniors.
>    - The sum of the `MonthlyCharges` per `PaymentMethod` for Churn / Non-churn customers
>    - Also, try using the tradtional group by aggregations combined with the unstack() method to create the above tables.

#### The average MonthlyCharges per InternetService for males and females.

In [7]:
# Method 1 with pivot table
df.pivot_table('MonthlyCharges', index='InternetService', columns='gender', aggfunc='mean')

gender              Female       Male
InternetService
DSL              58.590741  57.631427
Fiber optic      91.472569  91.527868
No               21.110710  21.048973

In [8]:
#Method 2 with groupby and unstack
df.groupby(['InternetService', 'gender'])[['MonthlyCharges']].aggregate('mean').unstack()

                MonthlyCharges
gender                  Female       Male
InternetService
DSL                  58.590741  57.631427
Fiber optic          91.472569  91.527868
No                   21.110710  21.048973

#### The maximum MonthlyCharges per Contract for Seniors / Non-seniors.

In [9]:
# Method 1 with pivot table
df.pivot_table('MonthlyCharges', index='Contract', columns='SeniorCitizen', aggfunc='max')

SeniorCitizen        0       1
Contract
Month-to-month  115.65  117.45
One year        118.60  116.25
Two year        118.75  117.35

In [10]:
#Method 2 with groupby and unstack
df.groupby(['Contract', 'SeniorCitizen'])[['MonthlyCharges']].aggregate('max').unstack()

               MonthlyCharges
SeniorCitizen               0       1
Contract
Month-to-month         115.65  117.45
One year               118.60  116.25
Two year               118.75  117.35

#### The sum of the MonthlyCharges per PaymentMethod for Churn / Non-churn customers

In [11]:
# Method 1 with pivot table
df.pivot_table('MonthlyCharges', index='PaymentMethod', columns='Churn', aggfunc='sum')

Churn                            No       Yes
PaymentMethod
Bank transfer (automatic)  83653.55  20091.90
Credit card (automatic)    83285.25  17946.60
Electronic check           96056.25  84288.75
Mailed check               53990.70  16803.60

In [12]:
df.groupby(['PaymentMethod', 'Churn'])[['MonthlyCharges']].aggregate('sum').unstack()

                          MonthlyCharges
Churn                                 No       Yes
PaymentMethod
Bank transfer (automatic)       83653.55  20091.90
Credit card (automatic)         83285.25  17946.60
Electronic check                96056.25  84288.75
Mailed check                    53990.70  16803.60

### 2. Create a column named `InternetService Average`:
>    - For each customer, this value will be the overall average monthly charge for their respective internet service. (Overall average DSL monthly charge, Overall average Fibre Optic monthly charge, ...)
>    - Create a new column containing the ratio between the customers `MonthlyCharges` and the `InternetService Average`

In [13]:
df.columns

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents',
       'tenure', 'PhoneService', 'MultipleLines', 'InternetService',
       'OnlineSecurity', 'OnlineBackup', 'DeviceProtection', 'TechSupport',
       'StreamingTV', 'StreamingMovies', 'Contract', 'PaperlessBilling',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

#### For each customer, this value will be the overall average monthly charge for their respective internet service. (Overall average DSL monthly charge, Overall average Fibre Optic monthly charge, ...)

In [14]:
columns = ['customerID', 'MonthlyCharges', 'InternetService', 'InternetService_Average']
df['InternetService_Average'] = df.groupby(['InternetService'])[['MonthlyCharges']].transform(np.mean)

df[columns]

      customerID  MonthlyCharges InternetService  InternetService_Average
0     7590-VHVEG           29.85             DSL                58.102169
1     5575-GNVDE           56.95             DSL                58.102169
2     3668-QPYBK           53.85             DSL                58.102169
3     7795-CFOCW           42.30             DSL                58.102169
4     9237-HQITU           70.70     Fiber optic                91.500129
...          ...             ...             ...                      ...
7038  6840-RESVB           84.80             DSL                58.102169
7039  2234-XADUH          103.20     Fiber optic                91.500129
7040  4801-JZAZL           29.60             DSL                58.102169
7041  8361-LTMKD           74.40     Fiber optic                91.500129
7042  3186-AJIEK          105.65     Fiber optic                91.500129

[7043 rows x 4 columns]

#### Create a new column containing the ratio between the customers MonthlyCharges and the InternetService Average

In [15]:
df['Ratio'] = df['MonthlyCharges'] / df['InternetService_Average']
columns = ['customerID', 'MonthlyCharges', 'InternetService', 'InternetService_Average', 'Ratio']
df[columns]

,customerID,MonthlyCharges,InternetService,InternetService_Average,Ratio
0,7590-VHVEG,29.85,DSL,58.102169,0.513750
1,5575-GNVDE,56.95,DSL,58.102169,0.980170
2,3668-QPYBK,53.85,DSL,58.102169,0.926816
3,7795-CFOCW,42.30,DSL,58.102169,0.728028
4,9237-HQITU,70.70,Fiber optic,91.500129,0.772677
...,...,...,...,...,...
7038,6840-RESVB,84.80,DSL,58.102169,1.459498
7039,2234-XADUH,103.20,Fiber optic,91.500129,1.127867
7040,4801-JZAZL,29.60,DSL,58.102169,0.509447
7041,8361-LTMKD,74.40,Fiber optic,91.500129,0.813114
7042,3186-AJIEK,105.65,Fiber optic,91.500129,1.154643



---

# Employee Dataset:

Datasets can be downloaded here:

- https://s3.amazonaws.com/weclouddata/datasets/genai/ml_fundamentals/employee_departments.csv
- https://s3.amazonaws.com/weclouddata/datasets/genai/ml_fundamentals/employee_dept_emp.csv
- https://s3.amazonaws.com/weclouddata/datasets/genai/ml_fundamentals/employee_dept_manager.csv
- https://s3.amazonaws.com/weclouddata/datasets/genai/ml_fundamentals/employee_employees.csv
- https://s3.amazonaws.com/weclouddata/datasets/genai/ml_fundamentals/employee_salaries.csv
- https://s3.amazonaws.com/weclouddata/datasets/genai/ml_fundamentals/employee_titles.csv

You can either use !wget to download the csv files first or load the data directyl from Pandas read_csv

### Load in the multiple tables attached

#### departments dataset

In [16]:
# departments dataset load
departments = pd.read_csv('employee_departments.csv', header=None)

#Seeing the head of the dataset of departments
departments.head()

      0                 1
0  d009  Customer Service
1  d005       Development
2  d002           Finance
3  d003   Human Resources
4  d001         Marketing

In [17]:
departments.columns = ['dept_no', 'dept_name']

In [18]:
#Seeing the info of departments dataset
departments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   dept_no    9 non-null      object
 1   dept_name  9 non-null      object
dtypes: object(2)
memory usage: 276.0+ bytes

In [19]:
#Seeing the shape of departments datasaet
departments.shape

(9, 2)

In [20]:
#Seeing the describtion of departments dataset
departments.describe().T

          count unique               top freq
dept_no       9      9              d009    1
dept_name     9      9  Customer Service    1

#### employee_dept_emp dataset

In [21]:
#Loading the dataset of employee_dept_emp
dept_emp = pd.read_csv('employee_dept_emp.csv', header=None)

#Seeing the head of the dataset
dept_emp.head()

       0     1           2           3
0  10001  d005  1986-06-26  9999-01-01
1  10002  d007  1996-08-03  9999-01-01
2  10003  d004  1995-12-03  9999-01-01
3  10004  d004  1986-12-01  9999-01-01
4  10005  d003  1989-09-12  9999-01-01

In [22]:
dept_emp.columns = ['emp_no', 'dept_no', 'from_date', 'to_date']

In [23]:
dept_emp.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [24]:
dept_emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331603 entries, 0 to 331602
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     331603 non-null  int64
 1   dept_no    331603 non-null  object
 2   from_date  331603 non-null  object
 3   to_date    331603 non-null  object
dtypes: int64(1), object(3)
memory usage: 10.1+ MB

In [25]:
dept_emp.shape

(331603, 4)

In [26]:
dept_emp.describe().T

,count,mean,std,min,25%,50%,75%,max
emp_no,331603.0,253332.605025,161831.919445,10001.0,85005.5,250001.0,424999.5,499999.0

#### employee_dept_manager dataset

In [27]:
#Loading the dataset of employee_dept_manager
dept_man = pd.read_csv('employee_dept_manager.csv', header=None)

#Seeing the head of the dataset
dept_man.head()

      0       1           2           3
0  d001  110022  1985-01-01  1991-10-01
1  d001  110039  1991-10-01  9999-01-01
2  d002  110085  1985-01-01  1989-12-17
3  d002  110114  1989-12-17  9999-01-01
4  d003  110183  1985-01-01  1992-03-21

In [28]:
dept_man.columns = ['dept_no', 'emp_no', 'from_date', 'to_date']
dept_man.head()

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17
3    d002  110114  1989-12-17  9999-01-01
4    d003  110183  1985-01-01  1992-03-21

In [29]:
dept_man.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   dept_no    24 non-null     object
 1   emp_no     24 non-null     int64
 2   from_date  24 non-null     object
 3   to_date    24 non-null     object
dtypes: int64(1), object(3)
memory usage: 900.0+ bytes

In [30]:
dept_man.shape

(24, 4)

In [31]:
dept_man.describe().T

,count,mean,std,min,25%,50%,75%,max
emp_no,24.0,110780.833333,627.958713,110022.0,110284.25,110646.0,111199.75,111939.0

#### employee_employees dataset

In [32]:
#Loading the dataset of employee_employees
emp_emp = pd.read_csv('employee_employees.csv', header=None)

#Seeing the head of the datbast
emp_emp.head()

       0           1          2         3  4           5
0  10001  1953-09-02     Georgi   Facello  M  1986-06-26
1  10002  1964-06-02    Bezalel    Simmel  F  1985-11-21
2  10003  1959-12-03      Parto   Bamford  M  1986-08-28
3  10004  1954-05-01  Chirstian   Koblick  M  1986-12-01
4  10005  1955-01-21    Kyoichi  Maliniak  M  1989-09-12

In [33]:
emp_emp.columns =  ['emp_no', 'birth_date', 'first_name', 'last_name', 'gender', 'hire_date']
emp_emp.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [34]:
#Seeing the info of emp_emp dataset
emp_emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [35]:
#Seeing the shape of emp_emp dataset
emp_emp.shape

(300024, 6)

In [36]:
#Seeing the describtion of emp_emp dataset
emp_emp.describe().T

,count,mean,std,min,25%,50%,75%,max
emp_no,300024.0,253321.763392,161828.23554,10001.0,85006.75,249987.5,424993.25,499999.0

#### employee_salaries dataset

In [37]:
#Loading the employee_salaries dataset
emp_sal = pd.read_csv('employee_salaries.csv', header=None)

#Seeing the head of the dataset
emp_sal.head()

       0      1           2           3
0  10001  60117  1986-06-26  1987-06-26
1  10001  62102  1987-06-26  1988-06-25
2  10001  66074  1988-06-25  1989-06-25
3  10001  66596  1989-06-25  1990-06-25
4  10001  66961  1990-06-25  1991-06-25

In [38]:
emp_sal.columns = ['emp_no', 'salary', 'from_date', 'to_date']
emp_sal.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

In [39]:
#Seeing the info of the emp_sal dataset
emp_sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2844047 entries, 0 to 2844046
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   emp_no     int64
 1   salary     int64
 2   from_date  object
 3   to_date    object
dtypes: int64(2), object(2)
memory usage: 86.8+ MB

In [40]:
#Seeing the shape of emp_sal dataset
emp_sal.shape

(2844047, 4)

In [41]:
#Seeing the describtion of emp_sal dataset
emp_sal.describe().T

,count,mean,std,min,25%,50%,75%,max
emp_no,2844047.0,253057.443177,161844.741333,10001.0,84878.0,249780.0,424917.0,499999.0
salary,2844047.0,63810.744836,16904.831260,38623.0,50507.0,61143.0,74192.0,158220.0

#### employee_titles dataset

In [42]:
#Loading the dataset of employee_titles
emp_tit = pd.read_csv('employee_titles.csv', header=None)

#Seeing the head of the dataset
emp_tit.head()

       0                1           2           3
0  10001  Senior Engineer  1986-06-26  9999-01-01
1  10002            Staff  1996-08-03  9999-01-01
2  10003  Senior Engineer  1995-12-03  9999-01-01
3  10004         Engineer  1986-12-01  1995-12-01
4  10004  Senior Engineer  1995-12-01  9999-01-01

In [43]:
emp_tit.columns = ['emp_no', 'title', 'from_date', 'to_date']
emp_tit.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [44]:
#Seeing the info of the dataset
emp_tit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [45]:
#Seeing the shape of the dataset of emp_tit
emp_tit.shape

(443308, 4)

In [46]:
#Seeing the describtion of the dataset of emp_tit
emp_tit.describe().T

,count,mean,std,min,25%,50%,75%,max
emp_no,443308.0,253075.03443,161853.292613,10001.0,84855.75,249847.5,424891.25,499999.0

### 1. Explore each table, merge the tables together with the `employees` table

### 2. How many employees have worked in multiple departments within the dataset?

In [47]:
dept_emp.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [48]:
dept_emp['dept_num'] = dept_emp.groupby(['emp_no'])[['dept_no']].transform('count')

In [49]:
dept_emp.duplicated(subset='dept_no').sum()

331594

In [50]:
dept_emp_copy = dept_emp.copy()
dept_emp_copy.head()

   emp_no dept_no   from_date     to_date  dept_num
0   10001    d005  1986-06-26  9999-01-01         1
1   10002    d007  1996-08-03  9999-01-01         1
2   10003    d004  1995-12-03  9999-01-01         1
3   10004    d004  1986-12-01  9999-01-01         1
4   10005    d003  1989-09-12  9999-01-01         1

In [51]:
len(dept_emp_copy[dept_emp_copy['dept_num']>1].drop_duplicates(subset='emp_no'))

31579

### 3. How many employees have worked under multiple titles (Changed positions)?
>    - Calculate their average salary (Use apply/transform/filter)
>    - Calculate the average time length for each job title.

####  How many employees have worked under multiple titles (Changed positions)?

In [52]:
# Your code below
emp_tit.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [53]:
emp_tit_copy = emp_tit.copy()

emp_tit_copy['mult_tit'] = emp_tit_copy.groupby(['emp_no'])['title'].transform('count')
emp_tit_copy.head()

   emp_no            title   from_date     to_date  mult_tit
0   10001  Senior Engineer  1986-06-26  9999-01-01         1
1   10002            Staff  1996-08-03  9999-01-01         1
2   10003  Senior Engineer  1995-12-03  9999-01-01         1
3   10004         Engineer  1986-12-01  1995-12-01         2
4   10004  Senior Engineer  1995-12-01  9999-01-01         2

In [54]:
titles = emp_tit_copy[emp_tit_copy['mult_tit'] > 1].drop_duplicates(subset='emp_no')
len(titles)

140270

#### Calculate their average salary (Use apply/transform/filter)

In [55]:
avg_titles = titles.merge(emp_sal, on='emp_no')
avg_titles.head()

,emp_no,title,from_date_x,to_date_x,mult_tit,salary,from_date_y,to_date_y
0,10004,Engineer,1986-12-01,1995-12-01,2,40054,1986-12-01,1987-12-01
1,10004,Engineer,1986-12-01,1995-12-01,2,42283,1987-12-01,1988-11-30
2,10004,Engineer,1986-12-01,1995-12-01,2,42542,1988-11-30,1989-11-30
3,10004,Engineer,1986-12-01,1995-12-01,2,46065,1989-11-30,1990-11-30
4,10004,Engineer,1986-12-01,1995-12-01,2,48271,1990-11-30,1991-11-30

In [56]:
avg_titles['avg_sal'] = avg_titles.groupby(['emp_no'])['salary'].transform(np.mean)
avg_titles

,emp_no,title,from_date_x,to_date_x,mult_tit,salary,from_date_y,to_date_y,avg_sal
0,10004,Engineer,1986-12-01,1995-12-01,2,40054,1986-12-01,1987-12-01,56512.250000
1,10004,Engineer,1986-12-01,1995-12-01,2,42283,1987-12-01,1988-11-30,56512.250000
2,10004,Engineer,1986-12-01,1995-12-01,2,42542,1988-11-30,1989-11-30,56512.250000
3,10004,Engineer,1986-12-01,1995-12-01,2,46065,1989-11-30,1990-11-30,56512.250000
4,10004,Engineer,1986-12-01,1995-12-01,2,48271,1990-11-30,1991-11-30,56512.250000
...,...,...,...,...,...,...,...,...,...
1748829,499998,Senior Staff,1998-12-27,9999-01-01,2,46206,1997-12-26,1998-12-26,46665.555556
1748830,499998,Senior Staff,1998-12-27,9999-01-01,2,47429,1998-12-26,1999-12-26,46665.555556
1748831,499998,Senior Staff,1998-12-27,9999-01-01,2,49971,1999-12-26,2000-12-25,46665.555556
1748832,499998,Senior Staff,1998-12-27,9999-01-01,2,51182,2000-12-25,2001-12-25,46665.555556
1748833,499998,Senior Staff,1998-12-27,9999-01-01,2,55003,2001-12-25,9999-01-01,46665.555556

In [57]:
avg_titles.drop_duplicates(['emp_no'])[['emp_no', 'mult_tit', 'avg_sal']]

         emp_no  mult_tit       avg_sal
0         10004         2  56512.250000
16        10005         2  87275.769231
29        10007         2  70826.714286
43        10009         3  78284.555556
61        10012         2  46902.800000
...         ...       ...           ...
1748773  499988         2  86700.714286
1748787  499992         2  64179.750000
1748803  499996         2  63134.142857
1748810  499997         2  66475.866667
1748825  499998         2  46665.555556

[140270 rows x 3 columns]

### 4. For dates displayed as `9999-01-01` , map them to `2021-01-01`.
>    - Convert the `hire_date`, `to_date`, `from_date` columns to datetime as well.

In [58]:
emp_emp.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [59]:
emp_emp['hire_date'] = emp_emp['hire_date'].replace('9999-01-01', '2021-01-01')

#### Convert the hire_date, to_date, from_date columns to datetime as well.

In [60]:
emp_emp['hire_date'] = emp_emp['hire_date'].apply(pd.to_datetime, errors='coerce')

emp_emp.head()

   emp_no  birth_date first_name last_name gender  hire_date
0   10001  1953-09-02     Georgi   Facello      M 1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F 1985-11-21
2   10003  1959-12-03      Parto   Bamford      M 1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M 1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M 1989-09-12

In [61]:
emp_emp.dtypes

emp_no                 int64
birth_date            object
first_name            object
last_name             object
gender                object
hire_date     datetime64[ns]
dtype: object

In [62]:
dates = ['to_date', 'from_date']

In [63]:
to_fix = [dept_emp, dept_man, emp_sal, emp_tit]

In [64]:
for t in to_fix:
    t[dates] = t[dates].replace('9999-01-01', '2021-01-01')
    t[dates] = t[dates].apply(pd.to_datetime, errors='coerce')

In [65]:
dept_emp.dtypes

emp_no                int64
dept_no              object
from_date    datetime64[ns]
to_date      datetime64[ns]
dept_num              int64
dtype: object

In [66]:
dept_man.dtypes

dept_no              object
emp_no                int64
from_date    datetime64[ns]
to_date      datetime64[ns]
dtype: object

In [67]:
emp_sal.dtypes

emp_no                int64
salary                int64
from_date    datetime64[ns]
to_date      datetime64[ns]
dtype: object

In [68]:
emp_tit.dtypes

emp_no                int64
title                object
from_date    datetime64[ns]
to_date      datetime64[ns]
dtype: object

### 5. Create a new column `age`, extract the age of all the employees from the dataset by using `2021-01-01` as the reference date.

In [69]:
emp_emp.dtypes

emp_no                 int64
birth_date            object
first_name            object
last_name             object
gender                object
hire_date     datetime64[ns]
dtype: object

In [70]:
emp_emp['birth_date'] = emp_emp['birth_date'].replace('1999-01-01', '2021-01-01')
emp_emp['birth_date'] = emp_emp['birth_date'].apply(pd.to_datetime, errors='coerce')

In [71]:
emp_emp.dtypes

emp_no                 int64
birth_date    datetime64[ns]
first_name            object
last_name             object
gender                object
hire_date     datetime64[ns]
dtype: object

In [72]:
from datetime import datetime

emp_emp['age'] = round((datetime.strptime('2021-01-01', '%Y-%m-%d') - emp_emp['birth_date']) / np.timedelta64(1, 'Y'), 2)
emp_emp.head()

   emp_no birth_date first_name last_name gender  hire_date    age
0   10001 1953-09-02     Georgi   Facello      M 1986-06-26  67.38
1   10002 1964-06-02    Bezalel    Simmel      F 1985-11-21  56.62
2   10003 1959-12-03      Parto   Bamford      M 1986-08-28  61.12
3   10004 1954-05-01  Chirstian   Koblick      M 1986-12-01  66.72
4   10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12  65.99

### 6. Create a new column `normalized_salary`:
>    - This column will return the following for each employee: `employees salary - average salary / standard deviation`

In [73]:
emp_sal.head()

   emp_no  salary  from_date    to_date
0   10001   60117 1986-06-26 1987-06-26
1   10001   62102 1987-06-26 1988-06-25
2   10001   66074 1988-06-25 1989-06-25
3   10001   66596 1989-06-25 1990-06-25
4   10001   66961 1990-06-25 1991-06-25

In [74]:
emp_sal['avg_sal'] = round(emp_sal['salary'].mean(axis=0))
emp_sal.head()

   emp_no  salary  from_date    to_date  avg_sal
0   10001   60117 1986-06-26 1987-06-26    63811
1   10001   62102 1987-06-26 1988-06-25    63811
2   10001   66074 1988-06-25 1989-06-25    63811
3   10001   66596 1989-06-25 1990-06-25    63811
4   10001   66961 1990-06-25 1991-06-25    63811

In [75]:
# employees salary - average salary / standard deviation
emp_sal['normalized_salary'] = (emp_sal['salary'] - emp_sal['avg_sal']) / emp_sal['salary'].std()
emp_sal.head()

   emp_no  salary  from_date    to_date  avg_sal  normalized_salary
0   10001   60117 1986-06-26 1987-06-26    63811          -0.218517
1   10001   62102 1987-06-26 1988-06-25    63811          -0.101095
2   10001   66074 1988-06-25 1989-06-25    63811           0.133867
3   10001   66596 1989-06-25 1990-06-25    63811           0.164746
4   10001   66961 1990-06-25 1991-06-25    63811           0.186337

### 7. Create a dataframe `summary_salary` containing the following elements:
>    - Find the MIN/MAX/MEAN salary for each job title
>    - Find the MIN/MAX/MEAN age for each job title

In [76]:
data = emp_emp.merge(emp_tit, on='emp_no').merge(emp_sal, on='emp_no')

summary_salary = data.copy()

summary_salary = summary_salary[['emp_no','age', 'title',  'salary']]

summary_salary.head()

   emp_no    age            title  salary
0   10001  67.38  Senior Engineer   60117
1   10001  67.38  Senior Engineer   62102
2   10001  67.38  Senior Engineer   66074
3   10001  67.38  Senior Engineer   66596
4   10001  67.38  Senior Engineer   66961

In [77]:
summary_salary.pivot_table(['salary', 'age'], index='title', aggfunc=['min', 'max', 'mean'])

                      min           max               mean
                      age salary    age  salary        age        salary
title
Assistant Engineer  55.95  38850  68.96  133712  62.456839  59304.986332
Engineer            55.95  38849  68.96  140784  62.450593  59508.039715
Manager             56.73  40000  68.56  108407  62.371804  66924.270619
Senior Engineer     55.95  38786  68.96  140784  62.455218  60543.219130
Senior Staff        55.95  38735  68.96  158220  62.474248  70470.835324
Staff               55.95  38735  68.96  158220  62.471709  69309.102266
Technique Leader    55.95  38623  68.96  144434  62.492916  59294.374165

### 8. Filter the dataframe for employees that have a salary greater than the average salary from their respective title.
>    - Some employees may have taken several positions, look at the employees most recent title for this calculation.

In [78]:
summary_salary['salary_mean'] = round(summary_salary.groupby('title')['salary'].transform(np.mean))
summary_salary.head()

   emp_no    age            title  salary  salary_mean
0   10001  67.38  Senior Engineer   60117      60543.0
1   10001  67.38  Senior Engineer   62102      60543.0
2   10001  67.38  Senior Engineer   66074      60543.0
3   10001  67.38  Senior Engineer   66596      60543.0
4   10001  67.38  Senior Engineer   66961      60543.0

In [82]:
recent_titles = summary_salary.groupby('emp_no').tail(1)
above_avg_salary = recent_titles[recent_titles['salary'] > recent_titles['salary_mean']]
above_avg_salary

         emp_no    age            title  salary  salary_mean
16        10001  67.38  Senior Engineer   88958      60543.0
22        10002  56.62            Staff   72527      69309.0
61        10004  66.72  Senior Engineer   74057      60543.0
87        10005  65.99            Staff   94692      69309.0
127       10007  63.65            Staff   88070      69309.0
...         ...    ...              ...     ...          ...
4638380  499988  58.30            Staff  102085      69309.0
4638426  499992  60.26            Staff   80389      69309.0
4638453  499996  67.87  Senior Engineer   69501      60543.0
4638483  499997  59.45  Senior Engineer   83441      60543.0
4638506  499999  62.72         Engineer   77303      59508.0

[178920 rows x 5 columns]

In [83]:

above_avg_salary[['emp_no', 'title', 'salary', 'salary_mean']]

         emp_no            title  salary  salary_mean
16        10001  Senior Engineer   88958      60543.0
22        10002            Staff   72527      69309.0
61        10004  Senior Engineer   74057      60543.0
87        10005            Staff   94692      69309.0
127       10007            Staff   88070      69309.0
...         ...              ...     ...          ...
4638380  499988            Staff  102085      69309.0
4638426  499992            Staff   80389      69309.0
4638453  499996  Senior Engineer   69501      60543.0
4638483  499997  Senior Engineer   83441      60543.0
4638506  499999         Engineer   77303      59508.0

[178920 rows x 4 columns]

### 9. Create a column `average_salary_ratio`.
>    - Store the ratio between the employees salary and the average salary of their respective title.

In [84]:
summary_salary['average_salary_ratio'] = summary_salary['salary'] / summary_salary['salary_mean']

summary_salary[['emp_no', 'title', 'salary', 'salary_mean', 'average_salary_ratio']]

         emp_no            title  salary  salary_mean  average_salary_ratio
0         10001  Senior Engineer   60117      60543.0              0.992964
1         10001  Senior Engineer   62102      60543.0              1.025750
2         10001  Senior Engineer   66074      60543.0              1.091357
3         10001  Senior Engineer   66596      60543.0              1.099979
4         10001  Senior Engineer   66961      60543.0              1.106007
...         ...              ...     ...          ...                   ...
4638502  499999         Engineer   63707      59508.0              1.070562
4638503  499999         Engineer   67043      59508.0              1.126622
4638504  499999         Engineer   70745      59508.0              1.188832
4638505  499999         Engineer   74327      59508.0              1.249025
4638506  499999         Engineer   77303      59508.0              1.299035

[4638507 rows x 5 columns]

### 10. Calculate the average salary for each job title, after filtering out employees who held a job title for more than 10 years.

In [91]:
emp_tit['title_length'] = round((emp_tit['to_date'] - emp_tit['from_date']) / np.timedelta64(1, 'Y'), 2)
filter_titles = emp_tit[emp_tit['title_length'] <= 10]
filter_titles.head()
# len(filter_titles['title_length'])

    emp_no               title  from_date    to_date  title_length
3    10004            Engineer 1986-12-01 1995-12-01          9.01
6    10005               Staff 1989-09-12 1996-09-12          7.01
9    10007               Staff 1989-02-10 1996-02-11          7.01
10   10008  Assistant Engineer 1998-03-11 2000-07-31          2.39
11   10009  Assistant Engineer 1985-02-18 1990-02-18          5.00

In [93]:
q10 = emp_sal.merge(filter_titles, on=['emp_no', 'from_date', 'to_date'])

round(q10.pivot_table('salary', index='title', aggfunc='mean').rename(columns={'salary': 'avg_salary_filtered'}))

                    avg_salary_filtered
title
Assistant Engineer              48362.0
Engineer                        48766.0
Senior Engineer                 48958.0
Senior Staff                    57956.0
Staff                           58083.0
Technique Leader                48749.0

### 11. Return the job titles where the average salary of females were higher than males.

In [94]:
q11 = pd.merge(emp_emp, emp_sal, on='emp_no')[['emp_no', 'gender', 'salary', 'from_date', 'to_date']]
q11.head()

   emp_no gender  salary  from_date    to_date
0   10001      M   60117 1986-06-26 1987-06-26
1   10001      M   62102 1987-06-26 1988-06-25
2   10001      M   66074 1988-06-25 1989-06-25
3   10001      M   66596 1989-06-25 1990-06-25
4   10001      M   66961 1990-06-25 1991-06-25

In [95]:
emp_tit[emp_tit['emp_no'] == 499998]

        emp_no         title  from_date    to_date  title_length
443305  499998  Senior Staff 1998-12-27 2021-01-01         22.03
443306  499998         Staff 1993-12-27 1998-12-27          5.00

In [96]:
q11[q11['emp_no'] == 499998]

         emp_no gender  salary  from_date    to_date
2844033  499998      M   40000 1993-12-27 1994-12-27
2844034  499998      M   42140 1994-12-27 1995-12-27
2844035  499998      M   42357 1995-12-27 1996-12-26
2844036  499998      M   45702 1996-12-26 1997-12-26
2844037  499998      M   46206 1997-12-26 1998-12-26
2844038  499998      M   47429 1998-12-26 1999-12-26
2844039  499998      M   49971 1999-12-26 2000-12-25
2844040  499998      M   51182 2000-12-25 2001-12-25
2844041  499998      M   55003 2001-12-25 2021-01-01

In [99]:
emp_tit

        emp_no            title  from_date    to_date  title_length
0        10001  Senior Engineer 1986-06-26 2021-01-01         34.54
1        10002            Staff 1996-08-03 2021-01-01         24.43
2        10003  Senior Engineer 1995-12-03 2021-01-01         25.10
3        10004         Engineer 1986-12-01 1995-12-01          9.01
4        10004  Senior Engineer 1995-12-01 2021-01-01         25.10
...        ...              ...        ...        ...           ...
443303  499997         Engineer 1987-08-30 1992-08-29          5.00
443304  499997  Senior Engineer 1992-08-29 2021-01-01         28.36
443305  499998     Senior Staff 1998-12-27 2021-01-01         22.03
443306  499998            Staff 1993-12-27 1998-12-27          5.00
443307  499999         Engineer 1997-11-30 2021-01-01         23.10

[443308 rows x 5 columns]

In [100]:
# titles_trunc = titles[['emp_no', 'title', 'from_date', 'to_date']].copy()
# titles_trunc

titles_trunc = emp_tit.drop('title_length', axis=1)
titles_trunc

        emp_no            title  from_date    to_date
0        10001  Senior Engineer 1986-06-26 2021-01-01
1        10002            Staff 1996-08-03 2021-01-01
2        10003  Senior Engineer 1995-12-03 2021-01-01
3        10004         Engineer 1986-12-01 1995-12-01
4        10004  Senior Engineer 1995-12-01 2021-01-01
...        ...              ...        ...        ...
443303  499997         Engineer 1987-08-30 1992-08-29
443304  499997  Senior Engineer 1992-08-29 2021-01-01
443305  499998     Senior Staff 1998-12-27 2021-01-01
443306  499998            Staff 1993-12-27 1998-12-27
443307  499999         Engineer 1997-11-30 2021-01-01

[443308 rows x 4 columns]

In [101]:
q11_with_titles = pd.merge(q11, titles_trunc, on='emp_no')
q11_with_titles

,emp_no,gender,salary,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,M,60117,1986-06-26,1987-06-26,Senior Engineer,1986-06-26,2021-01-01
1,10001,M,62102,1987-06-26,1988-06-25,Senior Engineer,1986-06-26,2021-01-01
2,10001,M,66074,1988-06-25,1989-06-25,Senior Engineer,1986-06-26,2021-01-01
3,10001,M,66596,1989-06-25,1990-06-25,Senior Engineer,1986-06-26,2021-01-01
4,10001,M,66961,1990-06-25,1991-06-25,Senior Engineer,1986-06-26,2021-01-01
...,...,...,...,...,...,...,...,...
4638502,499999,M,63707,1997-11-30,1998-11-30,Engineer,1997-11-30,2021-01-01
4638503,499999,M,67043,1998-11-30,1999-11-30,Engineer,1997-11-30,2021-01-01
4638504,499999,M,70745,1999-11-30,2000-11-29,Engineer,1997-11-30,2021-01-01
4638505,499999,M,74327,2000-11-29,2001-11-29,Engineer,1997-11-30,2021-01-01
4638506,499999,M,77303,2001-11-29,2021-01-01,Engineer,1997-11-30,2021-01-01

In [104]:
desired_rows = q11_with_titles.query('from_date_x >= from_date_y and to_date_x <= to_date_y')
desired_col = ['emp_no', 'gender', 'salary', 'title','from_date_x', 'to_date_x']
q11_final = desired_rows[desired_col]
q11_final

         emp_no gender  salary            title from_date_x  to_date_x
0         10001      M   60117  Senior Engineer  1986-06-26 1987-06-26
1         10001      M   62102  Senior Engineer  1987-06-26 1988-06-25
2         10001      M   66074  Senior Engineer  1988-06-25 1989-06-25
3         10001      M   66596  Senior Engineer  1989-06-25 1990-06-25
4         10001      M   66961  Senior Engineer  1990-06-25 1991-06-25
...         ...    ...     ...              ...         ...        ...
4638502  499999      M   63707         Engineer  1997-11-30 1998-11-30
4638503  499999      M   67043         Engineer  1998-11-30 1999-11-30
4638504  499999      M   70745         Engineer  1999-11-30 2000-11-29
4638505  499999      M   74327         Engineer  2000-11-29 2001-11-29
4638506  499999      M   77303         Engineer  2001-11-29 2021-01-01

[2700839 rows x 6 columns]

In [107]:
q11_pivot = round(q11_final.pivot_table('salary', index='title', columns='gender', aggfunc='mean'))
q11_pivot

gender                    F        M
title
Assistant Engineer  53921.0  54222.0
Engineer            54801.0  54898.0
Manager             61572.0  72199.0
Senior Engineer     64671.0  64770.0
Senior Staff        74988.0  75026.0
Staff               64107.0  64102.0
Technique Leader    59241.0  59334.0

In [108]:
q11_pivot.query('F > M')

gender        F        M
title
Staff   64107.0  64102.0

### 12. Create a Pivot table to show the average salary per role for each department
>    - Create a pivot table to show the gender distribution for each department.
>    - Create a pivot table to show the gender distribution for each job title.

#### Create a Pivot table to show the average salary per role for each department

In [112]:
q12 = emp_sal.merge(dept_emp, how='left', on='emp_no').merge(emp_tit, how='left', on='emp_no')
q12 = q12[['emp_no', 'dept_no', 'title', 'salary']].copy()

q12.pivot_table('salary', index=['dept_no'], columns = 'title', aggfunc='mean')

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_no,,,,,,,
d001,NaN,NaN,88371.685714,NaN,73055.058461,71832.635598,NaN
d002,NaN,NaN,70815.888889,NaN,71663.507048,70539.356056,NaN
d003,NaN,NaN,58286.055556,NaN,56718.779702,55629.835517,NaN
d004,59459.421451,59858.139228,56233.400000,60886.093980,58292.777209,57263.046595,59555.514181
d005,59626.194750,59683.078618,59658.117647,60718.123633,58273.661979,56866.275816,59569.385967
d006,57147.835011,57396.516945,67130.935484,58500.512732,NaN,NaN,57016.215094
d007,NaN,NaN,85738.764706,NaN,81785.496510,80677.916047,NaN
d008,59756.659912,59673.762583,77535.181818,60617.729557,60841.213411,59616.470544,58807.883576
d009,58864.105226,59845.126359,54959.672414,60911.316945,59689.568299,58649.599888,59160.521693

In [114]:
q12.groupby(['dept_no', 'title'])['salary'].mean().unstack('title')

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_no,,,,,,,
d001,NaN,NaN,88371.685714,NaN,73055.058461,71832.635598,NaN
d002,NaN,NaN,70815.888889,NaN,71663.507048,70539.356056,NaN
d003,NaN,NaN,58286.055556,NaN,56718.779702,55629.835517,NaN
d004,59459.421451,59858.139228,56233.400000,60886.093980,58292.777209,57263.046595,59555.514181
d005,59626.194750,59683.078618,59658.117647,60718.123633,58273.661979,56866.275816,59569.385967
d006,57147.835011,57396.516945,67130.935484,58500.512732,NaN,NaN,57016.215094
d007,NaN,NaN,85738.764706,NaN,81785.496510,80677.916047,NaN
d008,59756.659912,59673.762583,77535.181818,60617.729557,60841.213411,59616.470544,58807.883576
d009,58864.105226,59845.126359,54959.672414,60911.316945,59689.568299,58649.599888,59160.521693

#### Create a pivot table to show the gender distribution for each department

In [115]:
q12_2 = dept_emp.merge(emp_emp, how='left', on='emp_no')
q12_2.groupby(['dept_no', 'gender'])['gender'].count().unstack('gender')

gender       F      M
dept_no
d001      8037  12174
d002      7015  10331
d003      7075  10711
d004     29549  43936
d005     34258  51449
d006      8078  12039
d007     20854  31391
d008      8439  12687
d009      9448  14132

#### Create a pivot table to show the gender distribution for each job title

In [ ]:
pivot_table = q12_3.pivot_table(index='title', columns='gender', values='emp_no', aggfunc='count')

In [119]:
q12_3 = emp_tit.merge(emp_emp, how='left', on='emp_no')
q12_3.groupby(['title', 'gender'])['gender'].count().unstack('gender')

gender                  F      M
title
Assistant Engineer   5952   9176
Engineer            46063  68940
Manager                13     11
Senior Engineer     39141  58609
Senior Staff        37087  55766
Staff               42854  64537
Technique Leader     6114   9045

In [120]:
q12_3.pivot_table(index='title', columns='gender', values='emp_no', aggfunc='count')

gender                  F      M
title
Assistant Engineer   5952   9176
Engineer            46063  68940
Manager                13     11
Senior Engineer     39141  58609
Senior Staff        37087  55766
Staff               42854  64537
Technique Leader     6114   9045